---
kind: method
id: M:Autodesk.Revit.DB.ParameterSet.GetEnumerator
source: html/f9ebdf56-c9f2-da83-bcbb-cc33ec2199f6.htm
---
# Autodesk.Revit.DB.ParameterSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.